from math import sin, cos, pi, sqrt, pow, atan


# коэффициенты ряда Фурье
def A(F, t, f, k=1):
    """аргументы: функция (массив точек), время(массив точек),
    частота, количество точек в периоде, номер гармоники"""
    n = len(F)
    # r = (2 / n) * sum([F[i] * cos(t[i] * 2 * pi * f * k) for i in range(n)])
    r = (2 / n) * sum([cos(t[i] * 2 * pi * f * k) for i in range(n)])
    # r = (2 / n) * sum([F[i] for i in range(n)])
    return r


def B(F, t, f, k=1):
    """аргументы: функция (массив точек), время(массив точек),
    частота, количество точек в периоде, номер гармоники"""
    n = len(F)
    return 2 / n * sum([F[i] * sin(2 * pi * f * k * t[i]) for i in range(n)])


def A0(F, n):
    """аргументы: функция (массив точек), количество точек в периоде"""
    return 2 / n * sum(F)


# Разложение в ряд Фурье
def fourier(t, f, A0, A1, B1):
    """Создание списка типа [t, F] для построения ряда Фурье
    Аргументы: массив времени, частота, коэффициенты"""
    F = [A0 / 2 + A1 * cos(2 * pi * f * t[i]) + B1 * sin(2 * pi * f * t[i]) for i in range(len(t))]
    return [t, F]


# def abs_W(Out, In):
#     """Создание списка типа [t, F] для построения ЛАХ
#     Аргументы: массив времени, массив амплитуд"""
#     # AbsW = max(abs(i) for i in Out[1]) / max(abs(i) for i in In[1])
#     # AbsWlog = 20 * math.log(max(abs(i) for i in Out[1]) / max(abs(i) for i in In[1]))
#     AbsWlog = [20 * math.log(o / i) for (o, i) in zip(Out, In)]
#     return AbsWlog

def abs_W(Ain, Bin, Aout, Bout):
    """Отношение амплитуд на одной частоте"""
    return sqrt((pow(Ain, 2) + pow(Bin, 2)) / (pow(Aout, 2) + pow(Bout, 2)))


def ksi(Ain, Bin, Aout, Bout):
    """Фаза на частоте (градусы)
    аргументы: """
    return (atan(Ain / Bin) - atan(Aout / Bout)) * 180 / pi


def LAFCH(Out, In, t, f):
    """Считает ЛАФЧХ для каждой отдельной частоты"""
    Ain = A(In, t, f)
    Bin = B(In, t, f)
    Aout = A(Out, t, f)
    Bout = B(Out, t, f)
    return [abs_W(Out, In), ksi(Ain, Bin, Aout, Bout)]


if __name__ == "__main__":
    # tests
    print(*range(10))
    F= [2053, 2053, 2079, 2088, 2099, 2110, 2122, 2133, 2144, 2156, 2167, 2178, 2189, 2200, 2212, 2223, 2235, 2246, 2257, 2268, 2279, 2290, 2301, 2312, 2323, 2335, 2346, 2357, 2368, 2379, 2390, 2401, 2414, 2425, 2435, 2447, 2458]
    t= [3971.2339000003412, 3972.2319499999285, 3973.2299999995157, 3974.2280500000343, 3975.2260999996215, 3976.22415000014, 3977.222287500277, 3978.220250000246, 3979.218299999833, 3980.2163500003517, 3981.214399999939, 3982.212449999526, 3983.2105000000447, 3984.208637500182, 3985.2066000001505, 3986.2046499997377, 3987.2027000002563, 3988.2007499998435, 3989.198800000362, 3990.196862500161, 3991.194974999875, 3992.1929374998435, 3993.190987500362, 3994.189050000161, 3995.187099999748, 3996.1851500002667, 3997.183199999854, 3998.181337499991, 3999.1792999999598, 4000.1773624997586, 4001.175387499854, 4002.173425000161, 4003.171474999748, 4004.183799999766, 4005.1819125004113, 4006.179837499745, 4007.1778624998406]
    n = 4
    s = 2/n * sum([F[i] * cos(2 * pi * t[i]) for i in range(n)])
    print(s)
    # print(abs_W([10, 8, 4, 2], [5, 4, 2, 1]))
